Revit 2022 API
IndependentTag.HasLeader Property
 Whether the tag has a leader or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public bool HasLeader { get; set; }
Visual Basic
Public Property HasLeader As Boolean
	Get
	Set
Visual C++
public:
property bool HasLeader {
	bool get ();
	void set (bool value);
}
Field Value
 True if the tag has a leader, or false otherwise.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace